In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [2]:
df = pd.DataFrame({
    "name": ["avi", "nancy", "sharu", "ronit", "umesh"],
    "age": [33,23,22,33,33],
    "sex": ["male", "female", "female", "male", "male"],
    "salary": [100,223,334,423,512]
})
df.to_sql('df', con=engine)

df

    name  age     sex  salary
0    avi   33    male     100
1  nancy   23  female     223
2  sharu   22  female     334
3  ronit   33    male     423
4  umesh   33    male     512

# SQL way

In [3]:
engine.execute("SELECT * FROM df").fetchall()

[(0, 'avi', 33, 'male', 100),
 (1, 'nancy', 23, 'female', 223),
 (2, 'sharu', 22, 'female', 334),
 (3, 'ronit', 33, 'male', 423),
 (4, 'umesh', 33, 'male', 512)]

# Pandas Way

In [4]:
df

    name  age     sex  salary
0    avi   33    male     100
1  nancy   23  female     223
2  sharu   22  female     334
3  ronit   33    male     423
4  umesh   33    male     512

# LIMIT

In [5]:
# sql vs pandas
engine.execute("SELECT * FROM df limit 3").fetchall()

[(0, 'avi', 33, 'male', 100),
 (1, 'nancy', 23, 'female', 223),
 (2, 'sharu', 22, 'female', 334)]

In [6]:
df.head(3)

    name  age     sex  salary
0    avi   33    male     100
1  nancy   23  female     223
2  sharu   22  female     334

# where clause

In [7]:
engine.execute("""SELECT * FROM df where name="nancy" """).fetchall()

[(1, 'nancy', 23, 'female', 223)]

In [8]:
df[df.name == "nancy"]

    name  age     sex  salary
1  nancy   23  female     223

In [9]:
# 'hi nancy'
# "hi nancy"

# "hi "nancy""
# "hi 'nancy'"
# "hi 'nancy - 'fish''"

"""  hi "nancy - 'fish'"  """

'  hi "nancy - \'fish\'"  '

In [10]:
n = "nancy"
f"hi {n}"

'hi nancy'

# distinct

In [11]:
engine.execute("""SELECT distinct age FROM df """).fetchall()

[(33,), (23,), (22,)]

In [15]:
df.age.unique()

array([33, 23, 22])

df.sex.value_counts()

# select

In [22]:
engine.execute("""SELECT name, age FROM df """).fetchall()

[('avi', 33), ('nancy', 23), ('sharu', 22), ('ronit', 33), ('umesh', 33)]

In [24]:
df["name"]

0      avi
1    nancy
2    sharu
3    ronit
4    umesh
Name: name, dtype: object

In [25]:
df[["name", "age"]]

    name  age
0    avi   33
1  nancy   23
2  sharu   22
3  ronit   33
4  umesh   33

In [27]:
True and False

False

In [28]:
True or False

True

In [29]:
engine.execute("""SELECT * FROM df where age<30 and salary>300""").fetchall()

[(2, 'sharu', 22, 'female', 334)]

In [32]:
df[ (df.age<30) & (df.salary>300) ]
# df[ () & ()]

    name  age     sex  salary
2  sharu   22  female     334